# СРАВНЕНИЕ
# > - больше
# < - меньше
# == - равно
# != - не равно
# >= - больше или равно
# <= - меньше или равно

# ЛОГИКА
# or - или
# and - и
# not - не

# АРИФМЕТИКА
# +, -, *, /
# ** - степень
# // - деление без дробей
# % - деление по модулю(остаток от деления)

# ПРИСВАИВАНИЕ
# =, +=, -=, *=, /=, //= ....

# ЧЛЕНСТВО - поиск
# in - включает
# not in - не включает


################## ПРИМЕРЫ ####################
# print(1 > 2)
# print(1 < 2)
# print(1 == 2)
# print(1 != 2)
# print(1 >= 2)
# print(1 <= 2)

# print(1+1 == 2 or 1*1 == 2)
# print(1+1 == 2 and 1*1 == 2)
# print(1+1 == 2 and 1*1 == 1)
# print(1+1 == 2 and not 1*1 == 1)
# print(1+1 == 2 and not 1*1 == 2)

# print(10 // 3)
# print(11 ** 2)
# print(10 % 3)

# a = 2
# a -= 13
# print(a)

print('abcd' in 'abcdef')
print('abcd' in 'ab')
print('abcd' not in 'abcdef')
print('abcd' not in 'ab')